[{"start_timestamp": "00:00:17.250", "end_timestamp": "00:00:24.750", "segment_annotation": {"local_clues": [{"id": "LC1", "timestamp": "00:00:19.000", "quote": "idea that the knees shouldn't go past the toes in the squat because it's", "clue": "Introduces the myth being busted, suggesting the knees might go past the toes during the squats in this segment."}, {"id": "LC2", "timestamp": "00:00:21.000", "quote": "improper technique or more likely to cause injury", "clue": "Mentions improper technique leading to injury, indicating that correcting this might be part of the focus."}, {"id": "LC3", "timestamp": "00:00:23.000", "quote": "knees shouldn't go past the toes in the squat because it's improper technique", "clue": "Restates the myth, emphasizing technique and knee position."}], "global_clues": [{"id": "GC1", "timestamp": "00:04:02.000", "quote": "your knees shouldn't go past your toes in the squat is busted", "clue": "Refutes the myth, indicating it is safe for the knees to go past the toes.", "relevance_to_segment": "This conclusion ties directly to the myth introduced in the segment, validating correct technique allowing knee travel past the toes."}, {"id": "GC2", "timestamp": "00:04:06.000", "quote": "heels must stay firmly planted on the ground a moderate forward knee travel is okay", "clue": "Depicts good form: heels on the ground and moderate forward knee travel.", "relevance_to_segment": "Provides instructions for correct squat form, making it relevant to any corrective guidance in the segment."}, {"id": "GC3", "timestamp": "00:04:08.000", "quote": "as long as you aren't shifting your weight up onto your toes", "clue": "Advises against shifting weight onto toes.", "relevance_to_segment": "Emphasizes staying balanced over the foot, crucial for identifying and correcting mistakes."}], "logical_inferences": [{"id": "LI1", "description": "Correcting Technique Myths", "details": "Based on local and global clues, this segment is likely addressing and correcting the myth that knees shouldn't go past the toes during squats. Proper form includes keeping heels grounded and allowing for moderate knee travel."}]}}, {"start_timestamp": "00:02:03.250", "end_timestamp": "00:02:17.250", "segment_annotation": {"local_clues": [{"id": "LC4", "timestamp": "00:02:06.000", "quote": "forces at other joints involved in the exercise so say like the hip or the low back", "clue": "Mentions the importance of considering hip and low back forces, hinting at the broader impact of squat form."}, {"id": "LC5", "timestamp": "00:02:08.000", "quote": "compared knee and hip torques in two variations of the squat", "clue": "Refers to a study comparing knee and hip torques, implying attention to joint strain."}, {"id": "LC6", "timestamp": "00:02:11.000", "quote": "one where their knees were permitted to travel past their toes and the other", "clue": "Describes the conditions of the squat variations, relevant to knee positioning."}], "global_clues": [{"id": "GC4", "timestamp": "00:03:49.000", "quote": "must not be excessive but instead should be carefully regulated", "clue": "Advises moderate and regulated knee travel.", "relevance_to_segment": "This caution aligns with the segment's discussion on joint forces and proper technique."}, {"id": "GC5", "timestamp": "00:04:08.000", "quote": "as long as you aren't shifting your weight up onto your toes", "clue": "Advises against shifting weight onto toes.", "relevance_to_segment": "The segment's focus on joint forces and knee travel makes this guidance crucial for safe squatting."}], "logical_inferences": [{"id": "LI2", "description": "Balancing Joint Forces", "details": "The segment stresses the importance of distributing forces across multiple joints (hip, back) rather than isolating one (knee). This indicates a holistic approach to correct squat form."}]}}, {"start_timestamp": "00:02:19.750", "end_timestamp": "00:02:35.250", "segment_annotation": {"local_clues": [{"id": "LC7", "timestamp": "00:02:24.500", "quote": "normal squat versus 117 Newton meters in the restricted", "clue": "Provides torque measurements for squat variations, indicating levels of strain experienced."}, {"id": "LC8", "timestamp": "00:02:28.000", "quote": "but just look at the difference in hip torque between these two techniques", "clue": "Comparing techniques based on hip torque, highlighting differences in strain."}, {"id": "LC9", "timestamp": "00:02:31.000", "quote": "more than a 10 fold difference in hip torque just by keeping the knees back", "clue": "Shows significant difference caused by knee position, implying importance of proper knee placement."}], "global_clues": [{"id": "GC6", "timestamp": "00:04:08.000", "quote": "as long as you aren't shifting your weight up onto your toes", "clue": "Emphasizes maintaining balance over foot.", "relevance_to_segment": "Applies to the discussion on torque and weight distribution in squats."}, {"id": "GC7", "timestamp": "00:04:11.000", "quote": "the bar should travel up and down in a perfectly straight line", "clue": "Defines correct bar path for squat.", "relevance_to_segment": "Relevant for ensuring proper technique and minimizing strain, discussed in the segment."}], "logical_inferences": [{"id": "LI3", "description": "Impact of Knee Positioning on Hip Torque", "details": "The segment likely demonstrates the significant effect knee positioning has on hip torque, advocating for regulated knee movement to minimize hip strain."}]}}, {"start_timestamp": "00:03:10.250", "end_timestamp": "00:03:21.250", "segment_annotation": {"local_clues": [{"id": "LC10", "timestamp": "00:03:14.000", "quote": "less stress on the lower back during an unrestricted squat", "clue": "Claims unrestricted squats reduce lower back stress."}, {"id": "LC11", "timestamp": "00:03:16.000", "quote": "practitioners shouldn't be overly strict with athletes", "clue": "Suggests flexibility in coaching knee displacement."}, {"id": "LC12", "timestamp": "00:03:19.000", "quote": "in coaching against anterior knee displacement", "clue": "Mentions coaching knee displacement specifically."}], "global_clues": [{"id": "GC8", "timestamp": "00:04:02.000", "quote": "your knees shouldn't go past your toes in the squat is busted", "clue": "Myth regarding knee position is debunked.", "relevance_to_segment": "Supports the idea of allowing some forward knee travel, aligning with the segment's advice."}, {"id": "GC9", "timestamp": "00:04:06.000", "quote": "heels must stay firmly planted on the ground", "clue": "Emphasizes correct stance with heels grounded.", "relevance_to_segment": "Critical for proper weight distribution and minimizing back stress, as discussed."}], "logical_inferences": [{"id": "LI4", "description": "Reduced Back Stress with Unrestricted Squats", "details": "The segment suggests that allowing knee travel reduces lower back stress, challenging overly restrictive coaching styles."}]}}, {"start_timestamp": "00:03:53.750", "end_timestamp": "00:04:06.250", "segment_annotation": {"local_clues": [{"id": "LC13", "timestamp": "00:04:02.000", "quote": "your knees shouldn't go past your toes in the squat is busted", "clue": "Statement debunking the myth about knee positioning."}, {"id": "LC14", "timestamp": "00:04:06.000", "quote": "heels must stay firmly planted on the ground", "clue": "Emphasizes the importance of keeping heels on the ground during squats."}, {"id": "LC15", "timestamp": "00:04:06.000", "quote": "a moderate forward knee travel is okay", "clue": "Moderate forward knee movement is acceptable as long as weight is balanced."}], "global_clues": [{"id": "GC10", "timestamp": "00:03:49.000", "quote": "must not be excessive but instead should be carefully regulated", "clue": "Moderation and regulation in knee travel.", "relevance_to_segment": "Guides the appropriate knee movement discussed in the segment."}, {"id": "GC11", "timestamp": "00:04:08.000", "quote": "as long as you aren't shifting your weight up onto your toes", "clue": "Avoid shifting weight onto toes.", "relevance_to_segment": "Key advice aligning with maintaining balance and correct form in squats, covered in the segment."}], "logical_inferences": [{"id": "LI5", "description": "Debunking Myths and Proper Technique", "details": "The segment confirms the safety of allowing knees to go past toes, stressing proper form, such as keeping heels grounded and balancing weight, to prevent injury and improve performance."}]}}, {"start_timestamp": "00:04:14.750", "end_timestamp": "00:04:22.250", "segment_annotation": {"local_clues": [{"id": "LC1", "timestamp": "00:04:14", "quote": "first the heels must stay firmly planted on the ground a moderate forward knee travel is okay as long as you aren't shifting your weight up onto your toes", "clue": "The segment likely covers the importance of keeping the heels firmly planted while allowing moderate knee travel without shifting weight onto the toes."}, {"id": "LC2", "timestamp": "00:04:19", "quote": "second the weight on the bar must stay centered over the middle of the foot this means that when you're looking at the squat from side on the bar should travel up and down in a perfectly straight line", "clue": "The segment emphasizes the importance of keeping the weight centered over the middle of the foot and maintaining a straight bar path."}, {"id": "LC3", "timestamp": "00:04:21", "quote": "thirdly your knees should generally point in the same direction as your toes they shouldn't cave in or be forced out excessively", "clue": "The segment highlights the proper alignment of the knees in the direction of the toes, avoiding excessive caving in or forcing out."}], "global_clues": [{"id": "GC1", "timestamp": "00:00:14", "quote": "this week we're gonna be looking at the idea that the knees shouldn't go past the toes in the squat because it's improper technique or more likely to cause injury to the knees", "clue": "The video explores the concept of whether knees should go past the toes when squatting.", "relevance_to_segment": "Connects to the emphasis on knee direction and proper technique mentioned in the segment."}, {"id": "GC2", "timestamp": "00:00:47", "quote": "much more recent literature has taken a hard line against this dataset for not controlling for squat depth and not including a description of the squat technique", "clue": "New literature opposes the old study due to lack of control for depth and technique.", "relevance_to_segment": "Underlines the significance of controlled and described squat techniques, like those highlighted in the segment."}, {"id": "GC3", "timestamp": "00:03:54", "quote": "forcing the knees to stay back will force lifters to lean further forward increasing strain on the hips and low back", "clue": "Restricting knee movement can increase strain on the hips and lower back.", "relevance_to_segment": "Related to the segment’s emphasis on allowing moderate knee travel to prevent forward lean and associated strains."}, {"id": "GC4", "timestamp": "00:04:28", "quote": "so to make this a little more actionable I think a good squat meets a few main criteria and the knees not going past the toes isn't one of them", "clue": "Good squats are defined by multiple criteria, not just knee position.", "relevance_to_segment": "Aligns with the segment’s focus on multiple aspects of proper squat form."}, {"id": "GC5", "timestamp": "00:04:49", "quote": "first the heels must stay firmly planted on the ground a moderate forward knee travel is okay as long as you aren't shifting your weight up onto your toes", "clue": "Planted heels and moderate forward knee travel are acceptable in a squat.", "relevance_to_segment": "Reinforces segment’s guidelines on heel position and knee travel."}], "logical_inferences": [{"id": "LI1", "description": "Importance of Heel Placement and Knee Travel", "details": "The emphasis on keeping heels planted and allowing moderate knee travel indicates that proper weight distribution and knee alignment were demonstrated in this segment to prevent common squat mistakes."}, {"id": "LI2", "description": "Balanced Bar and Foot Path", "details": "The segment’s focus on maintaining weight over the middle of the foot and ensuring a straight bar path suggests that these aspects were demonstrated to show the correct technique and prevent imbalances."}, {"id": "LI3", "description": "Knee Alignment and Direction", "details": "Given the segment’s instructions on knee direction, it’s inferred that correct knee alignment corresponding with toes was demonstrated to avoid injuries and ensure proper form."}]}}]